USE classvisit;

-- إضافة مؤشرات التقييم
INSERT INTO evaluation_indicators (domain_id, name, weight) VALUES
-- مؤشرات مجال التخطيط للدرس
(1, 'خطة الدرس متوفرة وبنودها مستكملة ومناسبة', 100),
(1, 'أهداف التعلم مناسبة ودقيقة الصياغة وقابلة للقياس', 100),
(1, 'أنشطة الدرس الرئيسة واضحة ومتدرجة ومرتبطة بالأهداف', 100),

-- مؤشرات مجال تنفيذ الدرس
(2, 'أهداف التعلم معروضة ويتم مناقشتها', 100),
(2, 'أنشطة التمهيد مفعلة بشكل مناسب', 100),
(2, 'محتوى الدرس واضح والعرض منظّم ومترابط', 100),
(2, 'طرائق التدريس وإستراتيجياته متنوعه وتتمحور حول الطالب', 100),
(2, 'مصادر التعلم الرئيسة والمساندة موظّفة بصورة واضحة وسليمة', 100),
(2, 'الوسائل التعليميّة والتكنولوجيا موظّفة بصورة مناسبة', 100),
(2, 'الأسئلة الصفية ذات صياغة سليمة ومتدرجة ومثيرة للتفكير', 100),
(2, 'المادة العلمية دقيقة و مناسبة', 100),
(2, 'الكفايات الأساسية متضمنة في السياق المعرفي للدرس', 100),
(2, 'القيم الأساسية متضمنة في السياق المعرفي للدرس', 100),
(2, 'التكامل بين محاور المادة ومع المواد الأخرى يتم بشكل مناسب', 100),
(2, 'الفروق الفردية بين الطلبة يتم مراعاتها', 100),
(2, 'غلق الدرس يتم بشكل مناسب', 100),

-- مؤشرات مجال التقويم
(3, 'أساليب التقويم (القبلي والبنائي والختامي) مناسبة ومتنوعة', 100),
(3, 'التغذية الراجعة متنوعة ومستمرة', 100),
(3, 'أعمال الطلبة متابعة ومصححة بدقة ورقيًا وإلكترونيًا', 100),

-- مؤشرات مجال الإدارة الصفية وبيئة التعلم
(4, 'البيئة الصفية إيجابية وآمنة وداعمة للتعلّم', 100),
(4, 'إدارة أنشطة التعلّم والمشاركات الصّفيّة تتم بصورة منظمة', 100),
(4, 'قوانين إدارة الصف وإدارة السلوك مفعّلة', 100),
(4, 'الاستثمار الأمثل لزمن الحصة', 100),

-- مؤشرات مجال النشاط العملي
(5, 'مدى صلاحية وتوافر الأدوات اللازمة لتنفيذ النشاط العملي', 100),
(5, 'شرح إجراءات الأمن والسلامة المناسبة للتجربة ومتابعة تفعيلها', 100),
(5, 'إعطاء تعليمات واضحة وسليمة لأداء النشاط العملي قبل وأثناء التنفيذ', 100),
(5, 'تسجيل الطلبة للملاحظات والنتائج أثناء تنفيذ النشاط العملي', 100),
(5, 'تقويم مهارات الطلبة أثناء تنفيذ النشاط العملي', 100); 